input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "dense1a1_bn"
  type: "BatchNorm"
  bottom: "pool1"
  top: "dense1a1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a1_scale"
  type: "Scale"
  bottom: "dense1a1_bn"
  top: "dense1a1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a1_relu"
  type: "ReLU"
  bottom: "dense1a1_bn"
  top: "dense1a1_bn"
}
layer {
  name: "dense1a1_conv"
  type: "Convolution"
  bottom: "dense1a1_bn"
  top: "dense1a1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a1_dropout"
  type: "Dropout"
  bottom: "dense1a1_conv"
  top: "dense1a1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b1_bn"
  type: "BatchNorm"
  bottom: "dense1a1_dropout"
  top: "dense1b1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b1_scale"
  type: "Scale"
  bottom: "dense1b1_bn"
  top: "dense1b1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b1_relu"
  type: "ReLU"
  bottom: "dense1b1_bn"
  top: "dense1b1_bn"
}
layer {
  name: "dense1b1_conv"
  type: "Convolution"
  bottom: "dense1b1_bn"
  top: "dense1b1_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b1_dropout"
  type: "Dropout"
  bottom: "dense1b1_conv"
  top: "dense1b1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b1_concat"
  type: "Concat"
  bottom: "pool1"
  bottom: "dense1b1_dropout"
  top: "dense1b1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1a2_bn"
  type: "BatchNorm"
  bottom: "dense1b1_concat"
  top: "dense1a2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a2_scale"
  type: "Scale"
  bottom: "dense1a2_bn"
  top: "dense1a2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a2_relu"
  type: "ReLU"
  bottom: "dense1a2_bn"
  top: "dense1a2_bn"
}
layer {
  name: "dense1a2_conv"
  type: "Convolution"
  bottom: "dense1a2_bn"
  top: "dense1a2_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a2_dropout"
  type: "Dropout"
  bottom: "dense1a2_conv"
  top: "dense1a2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b2_bn"
  type: "BatchNorm"
  bottom: "dense1a2_dropout"
  top: "dense1b2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b2_scale"
  type: "Scale"
  bottom: "dense1b2_bn"
  top: "dense1b2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b2_relu"
  type: "ReLU"
  bottom: "dense1b2_bn"
  top: "dense1b2_bn"
}
layer {
  name: "dense1b2_conv"
  type: "Convolution"
  bottom: "dense1b2_bn"
  top: "dense1b2_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b2_dropout"
  type: "Dropout"
  bottom: "dense1b2_conv"
  top: "dense1b2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b2_concat"
  type: "Concat"
  bottom: "dense1b1_concat"
  bottom: "dense1b2_dropout"
  top: "dense1b2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1a3_bn"
  type: "BatchNorm"
  bottom: "dense1b2_concat"
  top: "dense1a3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a3_scale"
  type: "Scale"
  bottom: "dense1a3_bn"
  top: "dense1a3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a3_relu"
  type: "ReLU"
  bottom: "dense1a3_bn"
  top: "dense1a3_bn"
}
layer {
  name: "dense1a3_conv"
  type: "Convolution"
  bottom: "dense1a3_bn"
  top: "dense1a3_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a3_dropout"
  type: "Dropout"
  bottom: "dense1a3_conv"
  top: "dense1a3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b3_bn"
  type: "BatchNorm"
  bottom: "dense1a3_dropout"
  top: "dense1b3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b3_scale"
  type: "Scale"
  bottom: "dense1b3_bn"
  top: "dense1b3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b3_relu"
  type: "ReLU"
  bottom: "dense1b3_bn"
  top: "dense1b3_bn"
}
layer {
  name: "dense1b3_conv"
  type: "Convolution"
  bottom: "dense1b3_bn"
  top: "dense1b3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b3_dropout"
  type: "Dropout"
  bottom: "dense1b3_conv"
  top: "dense1b3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b3_concat"
  type: "Concat"
  bottom: "dense1b2_concat"
  bottom: "dense1b3_dropout"
  top: "dense1b3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1a4_bn"
  type: "BatchNorm"
  bottom: "dense1b3_concat"
  top: "dense1a4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a4_scale"
  type: "Scale"
  bottom: "dense1a4_bn"
  top: "dense1a4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a4_relu"
  type: "ReLU"
  bottom: "dense1a4_bn"
  top: "dense1a4_bn"
}
layer {
  name: "dense1a4_conv"
  type: "Convolution"
  bottom: "dense1a4_bn"
  top: "dense1a4_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a4_dropout"
  type: "Dropout"
  bottom: "dense1a4_conv"
  top: "dense1a4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b4_bn"
  type: "BatchNorm"
  bottom: "dense1a4_dropout"
  top: "dense1b4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b4_scale"
  type: "Scale"
  bottom: "dense1b4_bn"
  top: "dense1b4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b4_relu"
  type: "ReLU"
  bottom: "dense1b4_bn"
  top: "dense1b4_bn"
}
layer {
  name: "dense1b4_conv"
  type: "Convolution"
  bottom: "dense1b4_bn"
  top: "dense1b4_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b4_dropout"
  type: "Dropout"
  bottom: "dense1b4_conv"
  top: "dense1b4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b4_concat"
  type: "Concat"
  bottom: "dense1b3_concat"
  bottom: "dense1b4_dropout"
  top: "dense1b4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1a5_bn"
  type: "BatchNorm"
  bottom: "dense1b4_concat"
  top: "dense1a5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a5_scale"
  type: "Scale"
  bottom: "dense1a5_bn"
  top: "dense1a5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a5_relu"
  type: "ReLU"
  bottom: "dense1a5_bn"
  top: "dense1a5_bn"
}
layer {
  name: "dense1a5_conv"
  type: "Convolution"
  bottom: "dense1a5_bn"
  top: "dense1a5_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a5_dropout"
  type: "Dropout"
  bottom: "dense1a5_conv"
  top: "dense1a5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b5_bn"
  type: "BatchNorm"
  bottom: "dense1a5_dropout"
  top: "dense1b5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b5_scale"
  type: "Scale"
  bottom: "dense1b5_bn"
  top: "dense1b5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b5_relu"
  type: "ReLU"
  bottom: "dense1b5_bn"
  top: "dense1b5_bn"
}
layer {
  name: "dense1b5_conv"
  type: "Convolution"
  bottom: "dense1b5_bn"
  top: "dense1b5_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b5_dropout"
  type: "Dropout"
  bottom: "dense1b5_conv"
  top: "dense1b5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b5_concat"
  type: "Concat"
  bottom: "dense1b4_concat"
  bottom: "dense1b5_dropout"
  top: "dense1b5_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1a6_bn"
  type: "BatchNorm"
  bottom: "dense1b5_concat"
  top: "dense1a6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1a6_scale"
  type: "Scale"
  bottom: "dense1a6_bn"
  top: "dense1a6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1a6_relu"
  type: "ReLU"
  bottom: "dense1a6_bn"
  top: "dense1a6_bn"
}
layer {
  name: "dense1a6_conv"
  type: "Convolution"
  bottom: "dense1a6_bn"
  top: "dense1a6_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1a6_dropout"
  type: "Dropout"
  bottom: "dense1a6_conv"
  top: "dense1a6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b6_bn"
  type: "BatchNorm"
  bottom: "dense1a6_dropout"
  top: "dense1b6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b6_scale"
  type: "Scale"
  bottom: "dense1b6_bn"
  top: "dense1b6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b6_relu"
  type: "ReLU"
  bottom: "dense1b6_bn"
  top: "dense1b6_bn"
}
layer {
  name: "dense1b6_conv"
  type: "Convolution"
  bottom: "dense1b6_bn"
  top: "dense1b6_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense1b6_dropout"
  type: "Dropout"
  bottom: "dense1b6_conv"
  top: "dense1b6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1b6_concat"
  type: "Concat"
  bottom: "dense1b5_concat"
  bottom: "dense1b6_dropout"
  top: "dense1b6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense1b7_bn"
  type: "BatchNorm"
  bottom: "dense1b6_concat"
  top: "dense1b7_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense1b7_scale"
  type: "Scale"
  bottom: "dense1b7_bn"
  top: "dense1b7_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense1b7_relu"
  type: "ReLU"
  bottom: "dense1b7_bn"
  top: "dense1b7_bn"
}
layer {
  name: "dense1b7_conv"
  type: "Convolution"
  bottom: "dense1b7_bn"
  top: "dense1b7_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense1b7_dropout"
  type: "Dropout"
  bottom: "dense1b7_conv"
  top: "dense1b7_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense1_pool"
  type: "Pooling"
  bottom: "dense1b7_dropout"
  top: "dense1_pool"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dense2a1_bn"
  type: "BatchNorm"
  bottom: "dense1_pool"
  top: "dense2a1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a1_scale"
  type: "Scale"
  bottom: "dense2a1_bn"
  top: "dense2a1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a1_relu"
  type: "ReLU"
  bottom: "dense2a1_bn"
  top: "dense2a1_bn"
}
layer {
  name: "dense2a1_conv"
  type: "Convolution"
  bottom: "dense2a1_bn"
  top: "dense2a1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a1_dropout"
  type: "Dropout"
  bottom: "dense2a1_conv"
  top: "dense2a1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b1_bn"
  type: "BatchNorm"
  bottom: "dense2a1_dropout"
  top: "dense2b1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b1_scale"
  type: "Scale"
  bottom: "dense2b1_bn"
  top: "dense2b1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b1_relu"
  type: "ReLU"
  bottom: "dense2b1_bn"
  top: "dense2b1_bn"
}
layer {
  name: "dense2b1_conv"
  type: "Convolution"
  bottom: "dense2b1_bn"
  top: "dense2b1_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b1_dropout"
  type: "Dropout"
  bottom: "dense2b1_conv"
  top: "dense2b1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b1_concat"
  type: "Concat"
  bottom: "dense1_pool"
  bottom: "dense2b1_dropout"
  top: "dense2b1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a2_bn"
  type: "BatchNorm"
  bottom: "dense2b1_concat"
  top: "dense2a2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a2_scale"
  type: "Scale"
  bottom: "dense2a2_bn"
  top: "dense2a2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a2_relu"
  type: "ReLU"
  bottom: "dense2a2_bn"
  top: "dense2a2_bn"
}
layer {
  name: "dense2a2_conv"
  type: "Convolution"
  bottom: "dense2a2_bn"
  top: "dense2a2_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a2_dropout"
  type: "Dropout"
  bottom: "dense2a2_conv"
  top: "dense2a2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b2_bn"
  type: "BatchNorm"
  bottom: "dense2a2_dropout"
  top: "dense2b2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b2_scale"
  type: "Scale"
  bottom: "dense2b2_bn"
  top: "dense2b2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b2_relu"
  type: "ReLU"
  bottom: "dense2b2_bn"
  top: "dense2b2_bn"
}
layer {
  name: "dense2b2_conv"
  type: "Convolution"
  bottom: "dense2b2_bn"
  top: "dense2b2_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b2_dropout"
  type: "Dropout"
  bottom: "dense2b2_conv"
  top: "dense2b2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b2_concat"
  type: "Concat"
  bottom: "dense2b1_concat"
  bottom: "dense2b2_dropout"
  top: "dense2b2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a3_bn"
  type: "BatchNorm"
  bottom: "dense2b2_concat"
  top: "dense2a3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a3_scale"
  type: "Scale"
  bottom: "dense2a3_bn"
  top: "dense2a3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a3_relu"
  type: "ReLU"
  bottom: "dense2a3_bn"
  top: "dense2a3_bn"
}
layer {
  name: "dense2a3_conv"
  type: "Convolution"
  bottom: "dense2a3_bn"
  top: "dense2a3_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a3_dropout"
  type: "Dropout"
  bottom: "dense2a3_conv"
  top: "dense2a3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b3_bn"
  type: "BatchNorm"
  bottom: "dense2a3_dropout"
  top: "dense2b3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b3_scale"
  type: "Scale"
  bottom: "dense2b3_bn"
  top: "dense2b3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b3_relu"
  type: "ReLU"
  bottom: "dense2b3_bn"
  top: "dense2b3_bn"
}
layer {
  name: "dense2b3_conv"
  type: "Convolution"
  bottom: "dense2b3_bn"
  top: "dense2b3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b3_dropout"
  type: "Dropout"
  bottom: "dense2b3_conv"
  top: "dense2b3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b3_concat"
  type: "Concat"
  bottom: "dense2b2_concat"
  bottom: "dense2b3_dropout"
  top: "dense2b3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a4_bn"
  type: "BatchNorm"
  bottom: "dense2b3_concat"
  top: "dense2a4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a4_scale"
  type: "Scale"
  bottom: "dense2a4_bn"
  top: "dense2a4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a4_relu"
  type: "ReLU"
  bottom: "dense2a4_bn"
  top: "dense2a4_bn"
}
layer {
  name: "dense2a4_conv"
  type: "Convolution"
  bottom: "dense2a4_bn"
  top: "dense2a4_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a4_dropout"
  type: "Dropout"
  bottom: "dense2a4_conv"
  top: "dense2a4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b4_bn"
  type: "BatchNorm"
  bottom: "dense2a4_dropout"
  top: "dense2b4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b4_scale"
  type: "Scale"
  bottom: "dense2b4_bn"
  top: "dense2b4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b4_relu"
  type: "ReLU"
  bottom: "dense2b4_bn"
  top: "dense2b4_bn"
}
layer {
  name: "dense2b4_conv"
  type: "Convolution"
  bottom: "dense2b4_bn"
  top: "dense2b4_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b4_dropout"
  type: "Dropout"
  bottom: "dense2b4_conv"
  top: "dense2b4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b4_concat"
  type: "Concat"
  bottom: "dense2b3_concat"
  bottom: "dense2b4_dropout"
  top: "dense2b4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a5_bn"
  type: "BatchNorm"
  bottom: "dense2b4_concat"
  top: "dense2a5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a5_scale"
  type: "Scale"
  bottom: "dense2a5_bn"
  top: "dense2a5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a5_relu"
  type: "ReLU"
  bottom: "dense2a5_bn"
  top: "dense2a5_bn"
}
layer {
  name: "dense2a5_conv"
  type: "Convolution"
  bottom: "dense2a5_bn"
  top: "dense2a5_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a5_dropout"
  type: "Dropout"
  bottom: "dense2a5_conv"
  top: "dense2a5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b5_bn"
  type: "BatchNorm"
  bottom: "dense2a5_dropout"
  top: "dense2b5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b5_scale"
  type: "Scale"
  bottom: "dense2b5_bn"
  top: "dense2b5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b5_relu"
  type: "ReLU"
  bottom: "dense2b5_bn"
  top: "dense2b5_bn"
}
layer {
  name: "dense2b5_conv"
  type: "Convolution"
  bottom: "dense2b5_bn"
  top: "dense2b5_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b5_dropout"
  type: "Dropout"
  bottom: "dense2b5_conv"
  top: "dense2b5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b5_concat"
  type: "Concat"
  bottom: "dense2b4_concat"
  bottom: "dense2b5_dropout"
  top: "dense2b5_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a6_bn"
  type: "BatchNorm"
  bottom: "dense2b5_concat"
  top: "dense2a6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a6_scale"
  type: "Scale"
  bottom: "dense2a6_bn"
  top: "dense2a6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a6_relu"
  type: "ReLU"
  bottom: "dense2a6_bn"
  top: "dense2a6_bn"
}
layer {
  name: "dense2a6_conv"
  type: "Convolution"
  bottom: "dense2a6_bn"
  top: "dense2a6_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a6_dropout"
  type: "Dropout"
  bottom: "dense2a6_conv"
  top: "dense2a6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b6_bn"
  type: "BatchNorm"
  bottom: "dense2a6_dropout"
  top: "dense2b6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b6_scale"
  type: "Scale"
  bottom: "dense2b6_bn"
  top: "dense2b6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b6_relu"
  type: "ReLU"
  bottom: "dense2b6_bn"
  top: "dense2b6_bn"
}
layer {
  name: "dense2b6_conv"
  type: "Convolution"
  bottom: "dense2b6_bn"
  top: "dense2b6_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b6_dropout"
  type: "Dropout"
  bottom: "dense2b6_conv"
  top: "dense2b6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b6_concat"
  type: "Concat"
  bottom: "dense2b5_concat"
  bottom: "dense2b6_dropout"
  top: "dense2b6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a7_bn"
  type: "BatchNorm"
  bottom: "dense2b6_concat"
  top: "dense2a7_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a7_scale"
  type: "Scale"
  bottom: "dense2a7_bn"
  top: "dense2a7_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a7_relu"
  type: "ReLU"
  bottom: "dense2a7_bn"
  top: "dense2a7_bn"
}
layer {
  name: "dense2a7_conv"
  type: "Convolution"
  bottom: "dense2a7_bn"
  top: "dense2a7_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a7_dropout"
  type: "Dropout"
  bottom: "dense2a7_conv"
  top: "dense2a7_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b7_bn"
  type: "BatchNorm"
  bottom: "dense2a7_dropout"
  top: "dense2b7_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b7_scale"
  type: "Scale"
  bottom: "dense2b7_bn"
  top: "dense2b7_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b7_relu"
  type: "ReLU"
  bottom: "dense2b7_bn"
  top: "dense2b7_bn"
}
layer {
  name: "dense2b7_conv"
  type: "Convolution"
  bottom: "dense2b7_bn"
  top: "dense2b7_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b7_dropout"
  type: "Dropout"
  bottom: "dense2b7_conv"
  top: "dense2b7_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b7_concat"
  type: "Concat"
  bottom: "dense2b6_concat"
  bottom: "dense2b7_dropout"
  top: "dense2b7_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a8_bn"
  type: "BatchNorm"
  bottom: "dense2b7_concat"
  top: "dense2a8_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a8_scale"
  type: "Scale"
  bottom: "dense2a8_bn"
  top: "dense2a8_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a8_relu"
  type: "ReLU"
  bottom: "dense2a8_bn"
  top: "dense2a8_bn"
}
layer {
  name: "dense2a8_conv"
  type: "Convolution"
  bottom: "dense2a8_bn"
  top: "dense2a8_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a8_dropout"
  type: "Dropout"
  bottom: "dense2a8_conv"
  top: "dense2a8_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b8_bn"
  type: "BatchNorm"
  bottom: "dense2a8_dropout"
  top: "dense2b8_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b8_scale"
  type: "Scale"
  bottom: "dense2b8_bn"
  top: "dense2b8_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b8_relu"
  type: "ReLU"
  bottom: "dense2b8_bn"
  top: "dense2b8_bn"
}
layer {
  name: "dense2b8_conv"
  type: "Convolution"
  bottom: "dense2b8_bn"
  top: "dense2b8_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b8_dropout"
  type: "Dropout"
  bottom: "dense2b8_conv"
  top: "dense2b8_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b8_concat"
  type: "Concat"
  bottom: "dense2b7_concat"
  bottom: "dense2b8_dropout"
  top: "dense2b8_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a9_bn"
  type: "BatchNorm"
  bottom: "dense2b8_concat"
  top: "dense2a9_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a9_scale"
  type: "Scale"
  bottom: "dense2a9_bn"
  top: "dense2a9_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a9_relu"
  type: "ReLU"
  bottom: "dense2a9_bn"
  top: "dense2a9_bn"
}
layer {
  name: "dense2a9_conv"
  type: "Convolution"
  bottom: "dense2a9_bn"
  top: "dense2a9_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a9_dropout"
  type: "Dropout"
  bottom: "dense2a9_conv"
  top: "dense2a9_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b9_bn"
  type: "BatchNorm"
  bottom: "dense2a9_dropout"
  top: "dense2b9_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b9_scale"
  type: "Scale"
  bottom: "dense2b9_bn"
  top: "dense2b9_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b9_relu"
  type: "ReLU"
  bottom: "dense2b9_bn"
  top: "dense2b9_bn"
}
layer {
  name: "dense2b9_conv"
  type: "Convolution"
  bottom: "dense2b9_bn"
  top: "dense2b9_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b9_dropout"
  type: "Dropout"
  bottom: "dense2b9_conv"
  top: "dense2b9_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b9_concat"
  type: "Concat"
  bottom: "dense2b8_concat"
  bottom: "dense2b9_dropout"
  top: "dense2b9_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a10_bn"
  type: "BatchNorm"
  bottom: "dense2b9_concat"
  top: "dense2a10_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a10_scale"
  type: "Scale"
  bottom: "dense2a10_bn"
  top: "dense2a10_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a10_relu"
  type: "ReLU"
  bottom: "dense2a10_bn"
  top: "dense2a10_bn"
}
layer {
  name: "dense2a10_conv"
  type: "Convolution"
  bottom: "dense2a10_bn"
  top: "dense2a10_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a10_dropout"
  type: "Dropout"
  bottom: "dense2a10_conv"
  top: "dense2a10_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b10_bn"
  type: "BatchNorm"
  bottom: "dense2a10_dropout"
  top: "dense2b10_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b10_scale"
  type: "Scale"
  bottom: "dense2b10_bn"
  top: "dense2b10_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b10_relu"
  type: "ReLU"
  bottom: "dense2b10_bn"
  top: "dense2b10_bn"
}
layer {
  name: "dense2b10_conv"
  type: "Convolution"
  bottom: "dense2b10_bn"
  top: "dense2b10_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b10_dropout"
  type: "Dropout"
  bottom: "dense2b10_conv"
  top: "dense2b10_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b10_concat"
  type: "Concat"
  bottom: "dense2b9_concat"
  bottom: "dense2b10_dropout"
  top: "dense2b10_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a11_bn"
  type: "BatchNorm"
  bottom: "dense2b10_concat"
  top: "dense2a11_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a11_scale"
  type: "Scale"
  bottom: "dense2a11_bn"
  top: "dense2a11_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a11_relu"
  type: "ReLU"
  bottom: "dense2a11_bn"
  top: "dense2a11_bn"
}
layer {
  name: "dense2a11_conv"
  type: "Convolution"
  bottom: "dense2a11_bn"
  top: "dense2a11_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a11_dropout"
  type: "Dropout"
  bottom: "dense2a11_conv"
  top: "dense2a11_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b11_bn"
  type: "BatchNorm"
  bottom: "dense2a11_dropout"
  top: "dense2b11_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b11_scale"
  type: "Scale"
  bottom: "dense2b11_bn"
  top: "dense2b11_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b11_relu"
  type: "ReLU"
  bottom: "dense2b11_bn"
  top: "dense2b11_bn"
}
layer {
  name: "dense2b11_conv"
  type: "Convolution"
  bottom: "dense2b11_bn"
  top: "dense2b11_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b11_dropout"
  type: "Dropout"
  bottom: "dense2b11_conv"
  top: "dense2b11_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b11_concat"
  type: "Concat"
  bottom: "dense2b10_concat"
  bottom: "dense2b11_dropout"
  top: "dense2b11_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2a12_bn"
  type: "BatchNorm"
  bottom: "dense2b11_concat"
  top: "dense2a12_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2a12_scale"
  type: "Scale"
  bottom: "dense2a12_bn"
  top: "dense2a12_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2a12_relu"
  type: "ReLU"
  bottom: "dense2a12_bn"
  top: "dense2a12_bn"
}
layer {
  name: "dense2a12_conv"
  type: "Convolution"
  bottom: "dense2a12_bn"
  top: "dense2a12_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2a12_dropout"
  type: "Dropout"
  bottom: "dense2a12_conv"
  top: "dense2a12_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b12_bn"
  type: "BatchNorm"
  bottom: "dense2a12_dropout"
  top: "dense2b12_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b12_scale"
  type: "Scale"
  bottom: "dense2b12_bn"
  top: "dense2b12_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b12_relu"
  type: "ReLU"
  bottom: "dense2b12_bn"
  top: "dense2b12_bn"
}
layer {
  name: "dense2b12_conv"
  type: "Convolution"
  bottom: "dense2b12_bn"
  top: "dense2b12_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense2b12_dropout"
  type: "Dropout"
  bottom: "dense2b12_conv"
  top: "dense2b12_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2b12_concat"
  type: "Concat"
  bottom: "dense2b11_concat"
  bottom: "dense2b12_dropout"
  top: "dense2b12_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense2b13_bn"
  type: "BatchNorm"
  bottom: "dense2b12_concat"
  top: "dense2b13_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense2b13_scale"
  type: "Scale"
  bottom: "dense2b13_bn"
  top: "dense2b13_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense2b13_relu"
  type: "ReLU"
  bottom: "dense2b13_bn"
  top: "dense2b13_bn"
}
layer {
  name: "dense2b13_conv"
  type: "Convolution"
  bottom: "dense2b13_bn"
  top: "dense2b13_conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense2b13_dropout"
  type: "Dropout"
  bottom: "dense2b13_conv"
  top: "dense2b13_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense2_pool"
  type: "Pooling"
  bottom: "dense2b13_dropout"
  top: "dense2_pool"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dense3a1_bn"
  type: "BatchNorm"
  bottom: "dense2_pool"
  top: "dense3a1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a1_scale"
  type: "Scale"
  bottom: "dense3a1_bn"
  top: "dense3a1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a1_relu"
  type: "ReLU"
  bottom: "dense3a1_bn"
  top: "dense3a1_bn"
}
layer {
  name: "dense3a1_conv"
  type: "Convolution"
  bottom: "dense3a1_bn"
  top: "dense3a1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a1_dropout"
  type: "Dropout"
  bottom: "dense3a1_conv"
  top: "dense3a1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b1_bn"
  type: "BatchNorm"
  bottom: "dense3a1_dropout"
  top: "dense3b1_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b1_scale"
  type: "Scale"
  bottom: "dense3b1_bn"
  top: "dense3b1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b1_relu"
  type: "ReLU"
  bottom: "dense3b1_bn"
  top: "dense3b1_bn"
}
layer {
  name: "dense3b1_conv"
  type: "Convolution"
  bottom: "dense3b1_bn"
  top: "dense3b1_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b1_dropout"
  type: "Dropout"
  bottom: "dense3b1_conv"
  top: "dense3b1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b1_concat"
  type: "Concat"
  bottom: "dense2_pool"
  bottom: "dense3b1_dropout"
  top: "dense3b1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a2_bn"
  type: "BatchNorm"
  bottom: "dense3b1_concat"
  top: "dense3a2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a2_scale"
  type: "Scale"
  bottom: "dense3a2_bn"
  top: "dense3a2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a2_relu"
  type: "ReLU"
  bottom: "dense3a2_bn"
  top: "dense3a2_bn"
}
layer {
  name: "dense3a2_conv"
  type: "Convolution"
  bottom: "dense3a2_bn"
  top: "dense3a2_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a2_dropout"
  type: "Dropout"
  bottom: "dense3a2_conv"
  top: "dense3a2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b2_bn"
  type: "BatchNorm"
  bottom: "dense3a2_dropout"
  top: "dense3b2_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b2_scale"
  type: "Scale"
  bottom: "dense3b2_bn"
  top: "dense3b2_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b2_relu"
  type: "ReLU"
  bottom: "dense3b2_bn"
  top: "dense3b2_bn"
}
layer {
  name: "dense3b2_conv"
  type: "Convolution"
  bottom: "dense3b2_bn"
  top: "dense3b2_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b2_dropout"
  type: "Dropout"
  bottom: "dense3b2_conv"
  top: "dense3b2_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b2_concat"
  type: "Concat"
  bottom: "dense3b1_concat"
  bottom: "dense3b2_dropout"
  top: "dense3b2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a3_bn"
  type: "BatchNorm"
  bottom: "dense3b2_concat"
  top: "dense3a3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a3_scale"
  type: "Scale"
  bottom: "dense3a3_bn"
  top: "dense3a3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a3_relu"
  type: "ReLU"
  bottom: "dense3a3_bn"
  top: "dense3a3_bn"
}
layer {
  name: "dense3a3_conv"
  type: "Convolution"
  bottom: "dense3a3_bn"
  top: "dense3a3_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a3_dropout"
  type: "Dropout"
  bottom: "dense3a3_conv"
  top: "dense3a3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b3_bn"
  type: "BatchNorm"
  bottom: "dense3a3_dropout"
  top: "dense3b3_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b3_scale"
  type: "Scale"
  bottom: "dense3b3_bn"
  top: "dense3b3_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b3_relu"
  type: "ReLU"
  bottom: "dense3b3_bn"
  top: "dense3b3_bn"
}
layer {
  name: "dense3b3_conv"
  type: "Convolution"
  bottom: "dense3b3_bn"
  top: "dense3b3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b3_dropout"
  type: "Dropout"
  bottom: "dense3b3_conv"
  top: "dense3b3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b3_concat"
  type: "Concat"
  bottom: "dense3b2_concat"
  bottom: "dense3b3_dropout"
  top: "dense3b3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a4_bn"
  type: "BatchNorm"
  bottom: "dense3b3_concat"
  top: "dense3a4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a4_scale"
  type: "Scale"
  bottom: "dense3a4_bn"
  top: "dense3a4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a4_relu"
  type: "ReLU"
  bottom: "dense3a4_bn"
  top: "dense3a4_bn"
}
layer {
  name: "dense3a4_conv"
  type: "Convolution"
  bottom: "dense3a4_bn"
  top: "dense3a4_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a4_dropout"
  type: "Dropout"
  bottom: "dense3a4_conv"
  top: "dense3a4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b4_bn"
  type: "BatchNorm"
  bottom: "dense3a4_dropout"
  top: "dense3b4_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b4_scale"
  type: "Scale"
  bottom: "dense3b4_bn"
  top: "dense3b4_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b4_relu"
  type: "ReLU"
  bottom: "dense3b4_bn"
  top: "dense3b4_bn"
}
layer {
  name: "dense3b4_conv"
  type: "Convolution"
  bottom: "dense3b4_bn"
  top: "dense3b4_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b4_dropout"
  type: "Dropout"
  bottom: "dense3b4_conv"
  top: "dense3b4_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b4_concat"
  type: "Concat"
  bottom: "dense3b3_concat"
  bottom: "dense3b4_dropout"
  top: "dense3b4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a5_bn"
  type: "BatchNorm"
  bottom: "dense3b4_concat"
  top: "dense3a5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a5_scale"
  type: "Scale"
  bottom: "dense3a5_bn"
  top: "dense3a5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a5_relu"
  type: "ReLU"
  bottom: "dense3a5_bn"
  top: "dense3a5_bn"
}
layer {
  name: "dense3a5_conv"
  type: "Convolution"
  bottom: "dense3a5_bn"
  top: "dense3a5_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a5_dropout"
  type: "Dropout"
  bottom: "dense3a5_conv"
  top: "dense3a5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b5_bn"
  type: "BatchNorm"
  bottom: "dense3a5_dropout"
  top: "dense3b5_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b5_scale"
  type: "Scale"
  bottom: "dense3b5_bn"
  top: "dense3b5_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b5_relu"
  type: "ReLU"
  bottom: "dense3b5_bn"
  top: "dense3b5_bn"
}
layer {
  name: "dense3b5_conv"
  type: "Convolution"
  bottom: "dense3b5_bn"
  top: "dense3b5_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b5_dropout"
  type: "Dropout"
  bottom: "dense3b5_conv"
  top: "dense3b5_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b5_concat"
  type: "Concat"
  bottom: "dense3b4_concat"
  bottom: "dense3b5_dropout"
  top: "dense3b5_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a6_bn"
  type: "BatchNorm"
  bottom: "dense3b5_concat"
  top: "dense3a6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a6_scale"
  type: "Scale"
  bottom: "dense3a6_bn"
  top: "dense3a6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a6_relu"
  type: "ReLU"
  bottom: "dense3a6_bn"
  top: "dense3a6_bn"
}
layer {
  name: "dense3a6_conv"
  type: "Convolution"
  bottom: "dense3a6_bn"
  top: "dense3a6_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a6_dropout"
  type: "Dropout"
  bottom: "dense3a6_conv"
  top: "dense3a6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b6_bn"
  type: "BatchNorm"
  bottom: "dense3a6_dropout"
  top: "dense3b6_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b6_scale"
  type: "Scale"
  bottom: "dense3b6_bn"
  top: "dense3b6_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b6_relu"
  type: "ReLU"
  bottom: "dense3b6_bn"
  top: "dense3b6_bn"
}
layer {
  name: "dense3b6_conv"
  type: "Convolution"
  bottom: "dense3b6_bn"
  top: "dense3b6_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b6_dropout"
  type: "Dropout"
  bottom: "dense3b6_conv"
  top: "dense3b6_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b6_concat"
  type: "Concat"
  bottom: "dense3b5_concat"
  bottom: "dense3b6_dropout"
  top: "dense3b6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a7_bn"
  type: "BatchNorm"
  bottom: "dense3b6_concat"
  top: "dense3a7_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a7_scale"
  type: "Scale"
  bottom: "dense3a7_bn"
  top: "dense3a7_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a7_relu"
  type: "ReLU"
  bottom: "dense3a7_bn"
  top: "dense3a7_bn"
}
layer {
  name: "dense3a7_conv"
  type: "Convolution"
  bottom: "dense3a7_bn"
  top: "dense3a7_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a7_dropout"
  type: "Dropout"
  bottom: "dense3a7_conv"
  top: "dense3a7_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b7_bn"
  type: "BatchNorm"
  bottom: "dense3a7_dropout"
  top: "dense3b7_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b7_scale"
  type: "Scale"
  bottom: "dense3b7_bn"
  top: "dense3b7_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b7_relu"
  type: "ReLU"
  bottom: "dense3b7_bn"
  top: "dense3b7_bn"
}
layer {
  name: "dense3b7_conv"
  type: "Convolution"
  bottom: "dense3b7_bn"
  top: "dense3b7_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b7_dropout"
  type: "Dropout"
  bottom: "dense3b7_conv"
  top: "dense3b7_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b7_concat"
  type: "Concat"
  bottom: "dense3b6_concat"
  bottom: "dense3b7_dropout"
  top: "dense3b7_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a8_bn"
  type: "BatchNorm"
  bottom: "dense3b7_concat"
  top: "dense3a8_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a8_scale"
  type: "Scale"
  bottom: "dense3a8_bn"
  top: "dense3a8_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a8_relu"
  type: "ReLU"
  bottom: "dense3a8_bn"
  top: "dense3a8_bn"
}
layer {
  name: "dense3a8_conv"
  type: "Convolution"
  bottom: "dense3a8_bn"
  top: "dense3a8_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a8_dropout"
  type: "Dropout"
  bottom: "dense3a8_conv"
  top: "dense3a8_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b8_bn"
  type: "BatchNorm"
  bottom: "dense3a8_dropout"
  top: "dense3b8_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b8_scale"
  type: "Scale"
  bottom: "dense3b8_bn"
  top: "dense3b8_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b8_relu"
  type: "ReLU"
  bottom: "dense3b8_bn"
  top: "dense3b8_bn"
}
layer {
  name: "dense3b8_conv"
  type: "Convolution"
  bottom: "dense3b8_bn"
  top: "dense3b8_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b8_dropout"
  type: "Dropout"
  bottom: "dense3b8_conv"
  top: "dense3b8_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b8_concat"
  type: "Concat"
  bottom: "dense3b7_concat"
  bottom: "dense3b8_dropout"
  top: "dense3b8_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a9_bn"
  type: "BatchNorm"
  bottom: "dense3b8_concat"
  top: "dense3a9_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a9_scale"
  type: "Scale"
  bottom: "dense3a9_bn"
  top: "dense3a9_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a9_relu"
  type: "ReLU"
  bottom: "dense3a9_bn"
  top: "dense3a9_bn"
}
layer {
  name: "dense3a9_conv"
  type: "Convolution"
  bottom: "dense3a9_bn"
  top: "dense3a9_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a9_dropout"
  type: "Dropout"
  bottom: "dense3a9_conv"
  top: "dense3a9_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b9_bn"
  type: "BatchNorm"
  bottom: "dense3a9_dropout"
  top: "dense3b9_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b9_scale"
  type: "Scale"
  bottom: "dense3b9_bn"
  top: "dense3b9_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b9_relu"
  type: "ReLU"
  bottom: "dense3b9_bn"
  top: "dense3b9_bn"
}
layer {
  name: "dense3b9_conv"
  type: "Convolution"
  bottom: "dense3b9_bn"
  top: "dense3b9_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b9_dropout"
  type: "Dropout"
  bottom: "dense3b9_conv"
  top: "dense3b9_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b9_concat"
  type: "Concat"
  bottom: "dense3b8_concat"
  bottom: "dense3b9_dropout"
  top: "dense3b9_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a10_bn"
  type: "BatchNorm"
  bottom: "dense3b9_concat"
  top: "dense3a10_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a10_scale"
  type: "Scale"
  bottom: "dense3a10_bn"
  top: "dense3a10_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a10_relu"
  type: "ReLU"
  bottom: "dense3a10_bn"
  top: "dense3a10_bn"
}
layer {
  name: "dense3a10_conv"
  type: "Convolution"
  bottom: "dense3a10_bn"
  top: "dense3a10_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a10_dropout"
  type: "Dropout"
  bottom: "dense3a10_conv"
  top: "dense3a10_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b10_bn"
  type: "BatchNorm"
  bottom: "dense3a10_dropout"
  top: "dense3b10_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3b10_scale"
  type: "Scale"
  bottom: "dense3b10_bn"
  top: "dense3b10_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3b10_relu"
  type: "ReLU"
  bottom: "dense3b10_bn"
  top: "dense3b10_bn"
}
layer {
  name: "dense3b10_conv"
  type: "Convolution"
  bottom: "dense3b10_bn"
  top: "dense3b10_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "dense3b10_dropout"
  type: "Dropout"
  bottom: "dense3b10_conv"
  top: "dense3b10_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "dense3b10_concat"
  type: "Concat"
  bottom: "dense3b9_concat"
  bottom: "dense3b10_dropout"
  top: "dense3b10_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "dense3a11_bn"
  type: "BatchNorm"
  bottom: "dense3b10_concat"
  top: "dense3a11_bn"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dense3a11_scale"
  type: "Scale"
  bottom: "dense3a11_bn"
  top: "dense3a11_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "dense3a11_relu"
  type: "ReLU"
  bottom: "dense3a11_bn"
  top: "dense3a11_bn"
}
layer {
  name: "dense3a11_conv"
  type: "Convolution"
  bottom: "dense3a11_bn"
  top: "dense3a11_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "dense3a11_dropout"
  type: "Dropout"
